[
  {
    "category": "anxiety",
    "triggers": [
      "anxious",
      "panic",
      "worried",
      "nervous",
      "tensed"
    ],
    "first_response": "I'm here for you. Anxiety can feel overwhelming, but you're not alone.",
    "follow_ups": [
      "Can you share what's been causing your anxiety?",
      "Have you felt this way before?",
      "Would you like to try a breathing technique with me?"
    ],
    "affirmation": "You're doing great by talking about it. Keep going at your own pace."
  },
  {
    "category": "sadness",
    "triggers": [
      "sad",
      "low",
      "depressed",
      "down",
      "cry"
    ],
    "first_response": "I'm really sorry you're feeling this way. You're not alone in this.",
    "follow_ups": [
      "Do you want to talk about what made you feel this way?",
      "Sometimes sharing helps ease the burden—what’s been on your mind?",
      "Would it help if we did a small gratitude exercise together?"
    ],
    "affirmation": "You have the strength to get through this. I'm here with you."
  },
  {
    "category": "excitement",
    "triggers": [
      "excited",
      "happy",
      "thrilled",
      "joyful",
      "awesome"
    ],
    "first_response": "That's amazing to hear! I'd love to know what's making you feel this way.",
    "follow_ups": [
      "What was the highlight of your day?",
      "Would you like to share more about it?",
      "How does that excitement affect the rest of your day?"
    ],
    "affirmation": "It's beautiful to witness your joy. Keep celebrating these moments!"
  },
  {
    "category": "loneliness",
    "triggers": [
      "alone",
      "lonely",
      "isolated",
      "nobody",
      "abandoned"
    ],
    "first_response": "You’re not alone here. I’m right here with you.",
    "follow_ups": [
      "Do you feel this often, or is it something new?",
      "Have you been able to connect with anyone recently?",
      "What kind of support would feel helpful right now?"
    ],
    "affirmation": "You matter deeply, and someone cares—me."
  },
  {
    "category": "tiredness",
    "triggers": [
      "tired",
      "exhausted",
      "drained",
      "fatigued",
      "burned out"
    ],
    "first_response": "It’s completely okay to feel tired. Your body and mind deserve rest.",
    "follow_ups": [
      "How long have you been feeling this way?",
      "Would you like to try a short break or self-care activity?",
      "Can I guide you through a quick relaxation technique?"
    ],
    "affirmation": "Rest is not a reward—it’s essential. Be kind to yourself."
  },
  {
    "category": "gratitude",
    "triggers": [
      "grateful",
      "thankful",
      "blessed",
      "appreciate"
    ],
    "first_response": "Gratitude is such a powerful emotion. It’s lovely you’re feeling this way.",
    "follow_ups": [
      "What are you most thankful for today?",
      "Would you like to reflect on a happy memory?",
      "Who or what brings the most joy to your life?"
    ],
    "affirmation": "Your light shines through. Keep nurturing it."
  }
]